In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

C:\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

# Object Creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.821846 -0.605048  1.152415  0.916584
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931
2013-01-03 -0.155262 -1.307352  1.362932  0.186694
2013-01-04  0.378560  0.799268  0.625388  0.665456
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030
2013-01-06 -0.720155 -0.037410 -1.059981 -0.774010

In [5]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(['test','train','test','train']),
                  'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing Data

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.821846 -0.605048  1.152415  0.916584
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931
2013-01-03 -0.155262 -1.307352  1.362932  0.186694
2013-01-04  0.378560  0.799268  0.625388  0.665456
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030

In [9]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.180771 -0.493765  0.159926  0.127271
std    0.713368  0.912628  1.017509  0.690817
min   -0.720155 -1.702903 -1.059981 -0.774010
25%   -0.307771 -1.131776 -0.572983 -0.429599
50%    0.111649 -0.357097  0.044778  0.295313
75%    0.711024 -0.055344  1.020658  0.600075
max    1.118246  0.799268  1.362932  0.916584

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.378560  0.799268  0.625388  0.665456
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030
2013-01-06 -0.720155 -0.037410 -1.059981 -0.774010

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
np.array(df)

array([[ 0.82184571, -0.60504787,  1.15241501,  0.91658364],
       [-0.35860742, -1.70290272, -0.53583136,  0.40393084],
       [-0.15526191, -1.3073518 ,  1.36293244,  0.1866944 ],
       [ 0.37856025,  0.79926789,  0.62538828,  0.66545649],
       [ 1.11824575, -0.10914549, -0.58536646, -0.63502998],
       [-0.72015528, -0.03741026, -1.05998052, -0.7740097 ]])

In [13]:
np.array(df2)

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.821846   -0.358607   -0.155262    0.378560    1.118246   -0.720155
B   -0.605048   -1.702903   -1.307352    0.799268   -0.109145   -0.037410
C    1.152415   -0.535831    1.362932    0.625388   -0.585366   -1.059981
D    0.916584    0.403931    0.186694    0.665456   -0.635030   -0.774010

In [16]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  0.916584  1.152415 -0.605048  0.821846
2013-01-02  0.403931 -0.535831 -1.702903 -0.358607
2013-01-03  0.186694  1.362932 -1.307352 -0.155262
2013-01-04  0.665456  0.625388  0.799268  0.378560
2013-01-05 -0.635030 -0.585366 -0.109145  1.118246
2013-01-06 -0.774010 -1.059981 -0.037410 -0.720155

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931
2013-01-03 -0.155262 -1.307352  1.362932  0.186694
2013-01-01  0.821846 -0.605048  1.152415  0.916584
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030
2013-01-06 -0.720155 -0.037410 -1.059981 -0.774010
2013-01-04  0.378560  0.799268  0.625388  0.665456

# Selection

In [18]:
df['A']

2013-01-01    0.821846
2013-01-02   -0.358607
2013-01-03   -0.155262
2013-01-04    0.378560
2013-01-05    1.118246
2013-01-06   -0.720155
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  0.821846 -0.605048  1.152415  0.916584
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931
2013-01-03 -0.155262 -1.307352  1.362932  0.186694

In [20]:
df['2013-01-02':'2013-01-04']

                   A         B         C         D
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931
2013-01-03 -0.155262 -1.307352  1.362932  0.186694
2013-01-04  0.378560  0.799268  0.625388  0.665456

**Selection by Label**

In [21]:
df.loc[dates[0]]

A    0.821846
B   -0.605048
C    1.152415
D    0.916584
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.821846 -0.605048
2013-01-02 -0.358607 -1.702903
2013-01-03 -0.155262 -1.307352
2013-01-04  0.378560  0.799268
2013-01-05  1.118246 -0.109145
2013-01-06 -0.720155 -0.037410

In [23]:
df.loc['2013-01-02':'2013-01-04',['A','B']]

                   A         B
2013-01-02 -0.358607 -1.702903
2013-01-03 -0.155262 -1.307352
2013-01-04  0.378560  0.799268

In [24]:
df.loc['2013-01-03',['A','B']]

A   -0.155262
B   -1.307352
Name: 2013-01-03 00:00:00, dtype: float64

In [25]:
df.loc[dates[0],'A']

0.8218457124175476

In [26]:
df.at[dates[0],'A']

0.8218457124175476

**Selection by Position**

In [27]:
df.iloc[3]

A    0.378560
B    0.799268
C    0.625388
D    0.665456
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.378560  0.799268
2013-01-05  1.118246 -0.109145

In [30]:
df.iloc[[1,2,3],[0,2]]

                   A         C
2013-01-02 -0.358607 -0.535831
2013-01-03 -0.155262  1.362932
2013-01-04  0.378560  0.625388

In [31]:
df.iloc[:,0:3]

                   A         B         C
2013-01-01  0.821846 -0.605048  1.152415
2013-01-02 -0.358607 -1.702903 -0.535831
2013-01-03 -0.155262 -1.307352  1.362932
2013-01-04  0.378560  0.799268  0.625388
2013-01-05  1.118246 -0.109145 -0.585366
2013-01-06 -0.720155 -0.037410 -1.059981

In [32]:
df.iloc[1,1]

-1.7029027208110898

In [33]:
df.iat[1,1]

-1.7029027208110898

**Boolean Indexing**

In [35]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.821846 -0.605048  1.152415  0.916584
2013-01-04  0.378560  0.799268  0.625388  0.665456
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030

In [36]:
df[df>0]

                   A         B         C         D
2013-01-01  0.821846       NaN  1.152415  0.916584
2013-01-02       NaN       NaN       NaN  0.403931
2013-01-03       NaN       NaN  1.362932  0.186694
2013-01-04  0.378560  0.799268  0.625388  0.665456
2013-01-05  1.118246       NaN       NaN       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [37]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.821846 -0.605048  1.152415  0.916584    one
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931    one
2013-01-03 -0.155262 -1.307352  1.362932  0.186694    two
2013-01-04  0.378560  0.799268  0.625388  0.665456  three
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030   four
2013-01-06 -0.720155 -0.037410 -1.059981 -0.774010  three

In [38]:
# isin
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.155262 -1.307352  1.362932  0.186694   two
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030  four

**Setting**

In [41]:
s1=pd.Series(range(1,7),index=pd.date_range('2013-01-02',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F']=s1
df

                   A         B         C         D    F
2013-01-01  0.821846 -0.605048  1.152415  0.916584  NaN
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931  1.0
2013-01-03 -0.155262 -1.307352  1.362932  0.186694  2.0
2013-01-04  0.378560  0.799268  0.625388  0.665456  3.0
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030  4.0
2013-01-06 -0.720155 -0.037410 -1.059981 -0.774010  5.0

In [47]:
df.at[dates[0],'A']=0
df.iat[0,1]=0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.152415  0.916584  NaN
2013-01-02 -0.358607 -1.702903 -0.535831  0.403931  1.0
2013-01-03 -0.155262 -1.307352  1.362932  0.186694  2.0
2013-01-04  0.378560  0.799268  0.625388  0.665456  3.0
2013-01-05  1.118246 -0.109145 -0.585366 -0.635030  4.0
2013-01-06 -0.720155 -0.037410 -1.059981 -0.774010  5.0

In [50]:
df.loc[:,'D']=np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.152415  5  NaN
2013-01-02 -0.358607 -1.702903 -0.535831  5  1.0
2013-01-03 -0.155262 -1.307352  1.362932  5  2.0
2013-01-04  0.378560  0.799268  0.625388  5  3.0
2013-01-05  1.118246 -0.109145 -0.585366  5  4.0
2013-01-06 -0.720155 -0.037410 -1.059981  5  5.0

In [52]:
df2 = df.copy()
df2[df2>0]=-df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.152415 -5  NaN
2013-01-02 -0.358607 -1.702903 -0.535831 -5 -1.0
2013-01-03 -0.155262 -1.307352 -1.362932 -5 -2.0
2013-01-04 -0.378560 -0.799268 -0.625388 -5 -3.0
2013-01-05 -1.118246 -0.109145 -0.585366 -5 -4.0
2013-01-06 -0.720155 -0.037410 -1.059981 -5 -5.0

# Missing Data

In [53]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.152415  5  NaN  1.0
2013-01-02 -0.358607 -1.702903 -0.535831  5  1.0  1.0
2013-01-03 -0.155262 -1.307352  1.362932  5  2.0  NaN
2013-01-04  0.378560  0.799268  0.625388  5  3.0  NaN

In [54]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.358607 -1.702903 -0.535831  5  1.0  1.0

In [55]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.152415  5  5.0  1.0
2013-01-02 -0.358607 -1.702903 -0.535831  5  1.0  1.0
2013-01-03 -0.155262 -1.307352  1.362932  5  2.0  5.0
2013-01-04  0.378560  0.799268  0.625388  5  3.0  5.0

In [56]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

**Stats**

In [57]:
# 按列
df.mean()

A    0.043797
B   -0.392924
C    0.159926
D    5.000000
F    3.000000
dtype: float64

In [58]:
# 按行
df.mean(1)

2013-01-01    1.538104
2013-01-02    0.680532
2013-01-03    1.380064
2013-01-04    1.960643
2013-01-05    1.884747
2013-01-06    1.636491
Freq: D, dtype: float64

In [59]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [60]:
pd.Series([1,3,5,np.nan,6,8],index=dates)

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64